# NumberOfNormals Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Mesh..::..NumberOfNormals Property
Mesh Class See Also
---
The number of normals associated with the mesh.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public int NumberOfNormals { get; }
```

Visual Basic
---
```text
Public ReadOnly Property NumberOfNormals As Integer
	Get
```

Visual C++
---
```text
public:
property int NumberOfNormals {
	int get ();
}
```

# Remarks
The number is always equal either to '1', or the number of facets, or the number of points. The DistributionOfNormals property indicates how normals are distributed along the polymesh. If there is only one normal available, it applies to the entire mesh. Curved surfaces have normal vectors associated with either every facet or every point/vertex of the tessellated polymesh.
# See Also
Mesh Class
Autodesk.Revit.DB Namespace